{
  "_name_or_path": "Muzmmillcoste/finetuned-dermnet",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Acne and Rosacea Photos",
    "1": "Actinic Keratosis Basal Cell Carcinoma and other Malignant Lesions",
    "2": "Atopic Dermatitis Photos",
    "3": "Bullous Disease Photos",
    "4": "Cellulitis Impetigo and other Bacterial Infections",
    "5": "Eczema Photos",
    "6": "Exanthems and Drug Eruptions",
    "7": "Hair Loss Photos Alopecia and other Hair Diseases",
    "8": "Herpes HPV and other STDs Photos",
    "9": "Light Diseases and Disorders of Pigmentation",
    "10": "Lupus and other Connective Tissue diseases",
    "11": "Melanoma Skin Cancer Nevi and Moles",
    "12": "Nail Fungus and other Nail Disease",
    "13": "Poison Ivy Photos and other Contact Dermatitis",
    "14": "Psoriasis pictures Lichen Planus and related diseases",
    "15": "Scabies Lyme Disease and other Infestations and Bites",
    "16": "Seborrheic Keratoses and other Benign Tumors",
    "17": "Systemic Disease",
    "18": "Tinea Ringworm Candidiasis and other Fungal Infections",
    "19": "Urticaria Hives",
    "20": "Vascular Tumors",
    "21": "Vasculitis Photos",
    "22": "Warts Molluscum and other Viral Infections"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acne and Rosacea Photos": 0,
    "Actinic Keratosis Basal Cell Carcinoma and other Malignant Lesions": 1,
    "Atopic Dermatitis Photos": 2,
    "Bullous Disease Photos": 3,
    "Cellulitis Impetigo and other Bacterial Infections": 4,
    "Eczema Photos": 5,
    "Exanthems and Drug Eruptions": 6,
    "Hair Loss Photos Alopecia and other Hair Diseases": 7,
    "Herpes HPV and other STDs Photos": 8,
    "Light Diseases and Disorders of Pigmentation": 9,
    "Lupus and other Connective Tissue diseases": 10,
    "Melanoma Skin Cancer Nevi and Moles": 11,
    "Nail Fungus and other Nail Disease": 12,
    "Poison Ivy Photos and other Contact Dermatitis": 13,
    "Psoriasis pictures Lichen Planus and related diseases": 14,
    "Scabies Lyme Disease and other Infestations and Bites": 15,
    "Seborrheic Keratoses and other Benign Tumors": 16,
    "Systemic Disease": 17,
    "Tinea Ringworm Candidiasis and other Fungal Infections": 18,
    "Urticaria Hives": 19,
    "Vascular Tumors": 20,
    "Vasculitis Photos": 21,
    "Warts Molluscum and other Viral Infections": 22
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0"
}
